einergehtnochrein/fifi__fifisdr-firmware/pdl/drivers/lpc1700/src/lpc17xx_mci.c
/* Copyright (c) 2011-2012, NXP Semiconductors
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * Redistributions of source code must retain the above copyright notice, this list
 * of conditions and the following disclaimer.
 * Redistributions in binary form must reproduce the above copyright notice, this list
 * of conditions and the following disclaimer in the documentation and/or
 * other materials provided with the distribution.
 * Neither the name of the author nor the names of its contributors may be used
 * to endorse or promote products derived from this software without specific
 * prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "lpc17xx_libconfig.h"

#if LPCLIB_MCI

/** \file
 *  \brief MCI driver implementation.
 *
 *  This file contains the driver code for the MCI peripheral.
 *
 *  \author NXP Semiconductors
 */


#include "lpc17xx_mci.h"
#include "lpc17xx_clkpwr.h"
#include "lpc17xx_dma.h"


#if !LPCLIB_DMA
#define DMA_ChannelHandle struct DMA_ChannelContext *
#endif

/** Card clock frequency (MCICLK) in case of interrupt driven transfer. */
#define MCICLK_INTERRUPT_MODE                   1000000ul


/** Field definition for hardware register MCIPWR. */
LPCLIB_DefineRegBit(MCI_PWR_CTRL,               0,  2);
LPCLIB_DefineRegBit(MCI_PWR_OPENDRAIN,          6,  1);
LPCLIB_DefineRegBit(MCI_PWR_ROD,                7,  1);

enum {
    MCI_PWR_CTRL_OFF = 0,
    MCI_PWR_CTRL_UP = 2,
    MCI_PWR_CTRL_ON = 3,
};
enum {
    MCI_PWR_OPENDRAIN_OFF = 0,
    MCI_PWR_OPENDRAIN_ON = 1,
};
enum {
    MCI_PWR_ROD_OFF = 0,
    MCI_PWR_ROD_ON = 1,
};

/** Field definition for hardware register MCIClock. */
LPCLIB_DefineRegBit(MCI_CLOCK_CLKDIV,           0,  8);
LPCLIB_DefineRegBit(MCI_CLOCK_ENABLE,           8,  1);
LPCLIB_DefineRegBit(MCI_CLOCK_PWRSAVE,          9,  1);
LPCLIB_DefineRegBit(MCI_CLOCK_BYPASS,           10, 1);
LPCLIB_DefineRegBit(MCI_CLOCK_WIDEBUS,          11, 1);

/** Field definition for hardware register MCICommand. */
LPCLIB_DefineRegBit(MCI_COMMAND_CMDINDEX,       0,  6);
LPCLIB_DefineRegBit(MCI_COMMAND_RESPONSE,       6,  1);
LPCLIB_DefineRegBit(MCI_COMMAND_LONGRSP,        7,  1);
LPCLIB_DefineRegBit(MCI_COMMAND_INTERRUPT,      8,  1);
LPCLIB_DefineRegBit(MCI_COMMAND_PENDING,        9,  1);
LPCLIB_DefineRegBit(MCI_COMMAND_ENABLE,         10, 1);

/** Field definition for hardware register MCIRespCommand. */
LPCLIB_DefineRegBit(MCI_RESPCOMMAND_RESPCMD,    0,  6);

/** Field definition for hardware register MCIDataLength. */
LPCLIB_DefineRegBit(MCI_DATALENGTH_DATALENGTH,  0,  16);

/** Field definition for hardware register MCIDataCtrl. */
LPCLIB_DefineRegBit(MCI_DATACTRL_ENABLE,        0,  1);
LPCLIB_DefineRegBit(MCI_DATACTRL_DIRECTION,     1,  1);
LPCLIB_DefineRegBit(MCI_DATACTRL_MODE,          2,  1);
LPCLIB_DefineRegBit(MCI_DATACTRL_DMAENABLE,     3,  1);
LPCLIB_DefineRegBit(MCI_DATACTRL_BLOCKSIZE,     4,  4);

enum {
    MCI_DATACTRL_BLOCKSIZE_512 = 9,
};

/** Field definition for hardware register MCIDataCnt. */
LPCLIB_DefineRegBit(MCI_DATACNT_DATACOUNT,      0,  16);

/** Field definition for hardware register MCIStatus. */
LPCLIB_DefineRegBit(MCI_STATUS_CMDCRCFAIL,      0,  1);
LPCLIB_DefineRegBit(MCI_STATUS_DATACRCFAIL,     1,  1);
LPCLIB_DefineRegBit(MCI_STATUS_CMDTIMEOUT,      2,  1);
LPCLIB_DefineRegBit(MCI_STATUS_DATATIMEOUT,     3,  1);
LPCLIB_DefineRegBit(MCI_STATUS_TXUNDERRUN,      4,  1);
LPCLIB_DefineRegBit(MCI_STATUS_RXOVERRUN,       5,  1);
LPCLIB_DefineRegBit(MCI_STATUS_CMDRESPOND,      6,  1);
LPCLIB_DefineRegBit(MCI_STATUS_CMDSENT,         7,  1);
LPCLIB_DefineRegBit(MCI_STATUS_DATAEND,         8,  1);
LPCLIB_DefineRegBit(MCI_STATUS_STARTBITERR,     9,  1);
LPCLIB_DefineRegBit(MCI_STATUS_DATABLOCKEND,    10, 1);
LPCLIB_DefineRegBit(MCI_STATUS_CMDACTIVE,       11, 1);
LPCLIB_DefineRegBit(MCI_STATUS_TXACTIVE,        12, 1);
LPCLIB_DefineRegBit(MCI_STATUS_RXACTIVE,        13, 1);
LPCLIB_DefineRegBit(MCI_STATUS_TXFIFOHALFEMPTY, 14, 1);
LPCLIB_DefineRegBit(MCI_STATUS_RXFIFOHALFFULL,  15, 1);
LPCLIB_DefineRegBit(MCI_STATUS_TXFIFOFULL,      16, 1);
LPCLIB_DefineRegBit(MCI_STATUS_RXFIFOFULL,      17, 1);
LPCLIB_DefineRegBit(MCI_STATUS_TXFIFOEMPTY,     18, 1);
LPCLIB_DefineRegBit(MCI_STATUS_RXFIFOEMPTY,     19, 1);
LPCLIB_DefineRegBit(MCI_STATUS_TXDATAAVLBL,     20, 1);
LPCLIB_DefineRegBit(MCI_STATUS_RXDATAAVLBL,     21, 1);

/** Field definition for hardware register MCIClear. */
LPCLIB_DefineRegBit(MCI_CLEAR_CMDCRCFAILCLR,    0,  1);
LPCLIB_DefineRegBit(MCI_CLEAR_DATACRCFAILCLR,   1,  1);
LPCLIB_DefineRegBit(MCI_CLEAR_CMDTIMEOUTCLR,    2,  1);
LPCLIB_DefineRegBit(MCI_CLEAR_DATATIMEOUTCLR,   3,  1);
LPCLIB_DefineRegBit(MCI_CLEAR_TXUNDERRUNCLR,    4,  1);
LPCLIB_DefineRegBit(MCI_CLEAR_RXOVERRUNCLR,     5,  1);
LPCLIB_DefineRegBit(MCI_CLEAR_CMDRESPENDCLR,    6,  1);
LPCLIB_DefineRegBit(MCI_CLEAR_CMDSENTCLR,       7,  1);
LPCLIB_DefineRegBit(MCI_CLEAR_DATAENDCLR,       8,  1);
LPCLIB_DefineRegBit(MCI_CLEAR_STARTBITERRCLR,   9,  1);
LPCLIB_DefineRegBit(MCI_CLEAR_DATABLOCKENDCLR,  10, 1);

/* Mask that includes all MCI_CLEAR bits. */
#define MCI_CLEAR_Msk ( 0               \
      | MCI_CLEAR_CMDCRCFAILCLR_Msk     \
      | MCI_CLEAR_DATACRCFAILCLR_Msk    \
      | MCI_CLEAR_CMDTIMEOUTCLR_Msk     \
      | MCI_CLEAR_DATATIMEOUTCLR_Msk    \
      | MCI_CLEAR_TXUNDERRUNCLR_Msk     \
      | MCI_CLEAR_RXOVERRUNCLR_Msk      \
      | MCI_CLEAR_CMDRESPENDCLR_Msk     \
      | MCI_CLEAR_CMDSENTCLR_Msk        \
      | MCI_CLEAR_DATAENDCLR_Msk        \
      | MCI_CLEAR_STARTBITERRCLR_Msk    \
      | MCI_CLEAR_DATABLOCKENDCLR_Msk   \
      )


