einergehtnochrein/fifi__fifisdr-firmware/pdl/drivers/lpc1700/src/lpc17xx_mci.c
/** Field definition for hardware register MCIMask0. */
LPCLIB_DefineRegBit(MCI_MASK0_CMDCRCFAIL,       0,  1);
LPCLIB_DefineRegBit(MCI_MASK0_DATACRCFAIL,      1,  1);
LPCLIB_DefineRegBit(MCI_MASK0_CMDTIMEOUT,       2,  1);
LPCLIB_DefineRegBit(MCI_MASK0_DATATIMEOUT,      3,  1);
LPCLIB_DefineRegBit(MCI_MASK0_TXUNDERRUN,       4,  1);
LPCLIB_DefineRegBit(MCI_MASK0_RXOVERRUN,        5,  1);
LPCLIB_DefineRegBit(MCI_MASK0_CMDRESPOND,       6,  1);
LPCLIB_DefineRegBit(MCI_MASK0_CMDSENT,          7,  1);
LPCLIB_DefineRegBit(MCI_MASK0_DATAEND,          8,  1);
LPCLIB_DefineRegBit(MCI_MASK0_STARTBITERR,      9,  1);
LPCLIB_DefineRegBit(MCI_MASK0_DATABLOCKEND,     10, 1);
LPCLIB_DefineRegBit(MCI_MASK0_CMDACTIVE,        11, 1);
LPCLIB_DefineRegBit(MCI_MASK0_TXACTIVE,         12, 1);
LPCLIB_DefineRegBit(MCI_MASK0_RXACTIVE,         13, 1);
LPCLIB_DefineRegBit(MCI_MASK0_TXFIFOHALFEMPTY,  14, 1);
LPCLIB_DefineRegBit(MCI_MASK0_RXFIFOHALFFULL,   15, 1);
LPCLIB_DefineRegBit(MCI_MASK0_TXFIFOFULL,       16, 1);
LPCLIB_DefineRegBit(MCI_MASK0_RXFIFOFULL,       17, 1);
LPCLIB_DefineRegBit(MCI_MASK0_TXFIFOEMPTY,      18, 1);
LPCLIB_DefineRegBit(MCI_MASK0_RXFIFOEMPTY,      19, 1);
LPCLIB_DefineRegBit(MCI_MASK0_TXDATAAVLBL,      20, 1);
LPCLIB_DefineRegBit(MCI_MASK0_RXDATAAVLBL,      21, 1);

/** Field definition for hardware register MCIFifoCnt. */
LPCLIB_DefineRegBit(MCI_FIFOCNT_DATACOUNT,      0,  15);


/** Command codes for SD Card */
typedef enum {
    MCI_CMD0__GO_IDLE_STATE             = 0,
    MCI_CMD1__SEND_OP_COND              = 1,
    MCI_CMD2__ALL_SEND_CID              = 2,
    MCI_CMD3__SEND_RELATIVE_ADDR        = 3,
    MCI_CMD4__SET_DSR                   = 4,
    MCI_CMD7__SELECT_DESELECT_CARD      = 7,
    MCI_CMD8__SEND_IF_COND              = 8,
    MCI_CMD9__SEND_CSD                  = 9,
    MCI_CMD10__SEND_CID                 = 10,
    MCI_CMD12__STOP_TRANSMISSION        = 12,
    MCI_CMD13__SEND_STATUS              = 13,
    MCI_CMD15__GO_INACTIVE_STATE        = 15,
    MCI_CMD16__SET_BLOCKLEN             = 16,
    MCI_CMD17__READ_SINGLE_BLOCK        = 17,
    MCI_CMD18__READ_MULTIPLE_BLOCK      = 18,
    MCI_CMD24__WRITE_BLOCK              = 24,
    MCI_CMD25__WRITE_MULTIPLE_BLOCK     = 25,
    MCI_CMD27__PROGRAM_CSD              = 27,
    MCI_CMD32__ERASE_WR_BLK_START       = 32,
    MCI_CMD33__ERASE_WR_BLK_END         = 33,
    MCI_CMD38__ERASE                    = 38,
    MCI_CMD42__LOCK_UNLOCK              = 42,
    MCI_CMD55__APP_CMD                  = 55,
    MCI_ACMD6__SET_BUS_WIDTH            = 6,
    MCI_ACMD13__SD_STATUS               = 13,
    MCI_ACMD22__SEND_NUM_WR_BLOCKS      = 22,
    MCI_ACMD23__SET_WR_BLK_ERASE_COUNT  = 23,
    MCI_ACMD41__SD_SEND_OP_COND         = 41,
    MCI_ACMD42__SET_CLK_CARD_DETECT     = 42,
    MCI_ACMD51__SEND_SCR                = 51,
} MCI_CommandOpcode;


/** Card response type. */
typedef enum {
    MCI_RESPONSE_NONE   = 0,
    MCI_RESPONSE_R1     = MCI_COMMAND_RESPONSE_Msk,
    MCI_RESPONSE_R1b    = MCI_COMMAND_RESPONSE_Msk,
    MCI_RESPONSE_R2     = MCI_COMMAND_RESPONSE_Msk | MCI_COMMAND_LONGRSP_Msk,
    MCI_RESPONSE_R3     = MCI_COMMAND_RESPONSE_Msk,
    MCI_RESPONSE_R6     = MCI_COMMAND_RESPONSE_Msk,
    MCI_RESPONSE_R7     = MCI_COMMAND_RESPONSE_Msk,
} MCI_ResponseType;


/** Flags for card features. */
typedef struct {
    unsigned int allow4Bit : 1;             /**< Supports four data lines */
    unsigned int isSDCard : 1;              /**< Is an SD card (and not MMC) */
    unsigned int supportSDV2 : 1;           /**< Supports SD card spec V2.00 */
    unsigned int isHighCapacity : 1;        /**< Is an SDHC card */
} MCI_Flags;



/** SD card states as described in SD Card official spec. */
typedef enum {
    MCI_STATE_UNKNOWN,                      /**< Unknown state. Use CMD0 to reach IDLE state */
    MCI_STATE_IDLE,                         /**< After power-on or CMD0 */
    MCI_STATE_IDLE_SENT_CMD8,               /**< After sending CMD8 from IDLE state */
    MCI_STATE_IDLE_SENT_ACMD41,             /**< After sending ACMD41 from IDLE state */
    MCI_STATE_READY_SENT_CMD2,              /**< After sending CMD2 in READY state */
    MCI_STATE_INACTIVE,
    MCI_STATE_IDENT_SENT_CMD3,              /**< After sending CMD3 in IDENT state */
    MCI_STATE_STANDBY_SENT_CMD9,            /**< After sending CMD9 in STANDBY state */
    MCI_STATE_STANDBY_SENT_CMD7,            /**< After sending SELECT (CMD7) in STANDBY state */
    MCI_STATE_STANDBY,
    MCI_STATE_TRANSFER_SENT_ACMD6,          /**< After sending ACMD6 when entering TRANSFER state */
    MCI_STATE_TRANSFER,
    MCI_STATE_DATA,
    MCI_STATE_DATA_SENT_CMD12,              /**< After sending CMD12 in DATA state (multiple block read) */
    MCI_STATE_RECEIVE,
    MCI_STATE_RECEIVE_SENT_CMD12,           /**< After sending CMD12 in RCV state (multiple block write) */
    MCI_STATE_PROGRAM,                      /**< Programming operation active */
    MCI_STATE_DISCONNECT,
} MCI_State;


/** CSD register version */
typedef enum MCI_CSDVersion {
    MCI_CSD_VERSION1 = 0,                   /**< CSD structure version 1.x */
    MCI_CSD_VERSION2 = 1,                   /**< CSD structure version 2.0 */
} MCI_CSDVersion;


/** Card Status Register fields */
LPCLIB_DefineRegBit(MCI_CARDSTATUS_READY_FOR_DATA,  8,  1);
LPCLIB_DefineRegBit(MCI_CARDSTATUS_CURRENT_STATE,   9,  4);


/** Device context. */
static struct MCI_Context {
    LPCLIB_Switch inUse;                    /**< Set if interface open */
    MCI_State state;
    MCI_Flags flags;                        /**< Card features and operating flags */
    uint32_t maxClockHz;                    /**< Maximum allowed card clock */
    int numRetriesACMD41;                   /**< Counts the retries of ACMD41 in init phase */
    uint32_t ocr;                           /**< Card's OCR register */
    uint32_t cid[4];                        /**< Card's CID register */
    uint32_t csd[4];                        /**< Card's CSD register */
    uint32_t capacity;                      /**< Storage capacity (in sectors) */
    uint32_t rca;                           /**< Assigned card address (RCA) */
    LPCLIB_Result result;                   /**< Used to pass R/W operation result */

    osMutexId accessMutex;
    osSemaphoreId syncSema;

    LPCLIB_Callback callback;               /**< Event handler */

    const uint32_t *pTx;
    uint32_t *pRx;

