einergehtnochrein/fifi__fifisdr-firmware/pdl/drivers/lpc1700/src/lpc17xx_mci.c
    DMA_ChannelHandle dma;                  /**< Handle of DMA channel (both read and write) */
    DMA_Job *pDmaJob;                       /**< DMA job */
} mciContext;


osMutexDef(mciAccessMutexDef);
osSemaphoreDef(mciSyncSemaDef);


/** Helper macros to control the CMD pin open-drain state. */
#define _MCI_enableOpenDrain()                                          \
    do {                                                                \
        LPCLIB_BITBAND(&LPC_MCI->POWER, MCI_PWR_OPENDRAIN_Pos) = 1;     \
    } while (0)

#define _MCI_disableOpenDrain()                                         \
    do {                                                                \
        LPCLIB_BITBAND(&LPC_MCI->POWER, MCI_PWR_OPENDRAIN_Pos) = 0;     \
    } while (0)


/** Helper function to prepare a COMMAND register word. */
static uint32_t _MCI_makeCommandWord (MCI_CommandOpcode command,
                                      MCI_ResponseType response,
                                      uint32_t flags)
{
    return flags | (command << MCI_COMMAND_CMDINDEX_Pos) | response;
}

/** Helper function to extract CSD version number. */
static MCI_CSDVersion _MCI_getCSDVersion (MCI_Handle handle)
{
    return (MCI_CSDVersion)((handle->csd[3] >> 30) & 0x03);
}

/** Helper function to extract card capacity (in sectors) from CSD structure. */
static uint32_t _MCI_getCardCapacity (MCI_Handle handle)
{
    uint32_t numSectors;

    if (_MCI_getCSDVersion(handle) == MCI_CSD_VERSION2) {
        numSectors = 1 + (((handle->csd[2] & 0x3F) << 16) | ((handle->csd[1] >> 16) & 0xFFFF));
    }
    else {
        numSectors =
                (1 + (((handle->csd[2] & 0x3FF) << 2) | ((handle->csd[1] >> 30) & 0x03)))
             *  (1u << (2 + ((handle->csd[1] >> 15) & 0x07)))
             *  (1u << ((handle->csd[2] >> 16) & 0x0F));
        numSectors = numSectors / 512;
    }

    return numSectors;
}



/** Send a command. */
static void MCI_sendCommand (uint32_t command, uint32_t argument, uint32_t intMask)
{
    LPC_MCI->MASK0 = intMask;
    LPC_MCI->ARGUMENT = argument;
    LPC_MCI->COMMAND = command;
}


/** Set the card clock frequency. */
static LPCLIB_Result MCI_setCardClock (MCI_Handle handle, uint32_t frequency)
{
    int divider;


    /* Limit to maximum board frequency */
    if (frequency > handle->maxClockHz) {
        frequency = handle->maxClockHz;
    }
    divider = (CLKPWR_getBusClock(CLKPWR_CLOCK_SDC) - 1) / (2 * frequency) + 1;
    if (frequency <= 400000ul) {
        LPC_MCI->CLOCK =
                (1 << MCI_CLOCK_ENABLE_Pos)
            |   (((divider - 1) << MCI_CLOCK_CLKDIV_Pos) & MCI_CLOCK_CLKDIV_Msk);
    }
    else {
        LPC_MCI->CLOCK =
                (1 << MCI_CLOCK_ENABLE_Pos)
            |   (1 << MCI_CLOCK_PWRSAVE_Pos)
            |   (((divider - 1) << MCI_CLOCK_CLKDIV_Pos) & MCI_CLOCK_CLKDIV_Msk);
    }

    return LPCLIB_SUCCESS;
}


/* Open the MCI block. */
LPCLIB_Result MCI_open (MCI_Name mciNum, MCI_Handle *pHandle)
{
    (void) mciNum;                                      /* The LPC has one MCI block only */
    MCI_Handle handle = &mciContext;

    CLKPWR_assertPeripheralReset(CLKPWR_RESET_SDC);     /* Assert MCI reset */
    CLKPWR_deassertPeripheralReset(CLKPWR_RESET_SDC);   /* Release MCI reset */
    CLKPWR_enableClock(CLKPWR_CLOCKSWITCH_SDC);         /* Enable MCI peripheral clock */

    if (!handle->inUse) {
        handle->accessMutex = osMutexCreate(osMutex(mciAccessMutexDef));
        handle->syncSema = osSemaphoreCreate(osSemaphore(mciSyncSemaDef), 1);

        handle->inUse = LPCLIB_YES;
        *pHandle = handle;                              /* Return handle */

        return LPCLIB_SUCCESS;
    }

    *pHandle = LPCLIB_INVALID_HANDLE;

    return LPCLIB_BUSY;
}



/* Close the MCI interface. */
void MCI_close (MCI_Handle *pHandle)
{
    if (*pHandle == LPCLIB_INVALID_HANDLE) {
        return;
    }

    CLKPWR_disableClock(CLKPWR_CLOCKSWITCH_SDC);        /* Disable MCI peripheral clock */

//TODO    LPCLIB_OSALMutexDelete((*pHandle)->accessMutex);
//TODO    LPCLIB_OSALSemaphoreDelete((*pHandle)->syncSema);

    (*pHandle)->inUse = LPCLIB_NO;
    *pHandle = LPCLIB_INVALID_HANDLE;                   /* Invalidate the handle */
}



/* Configure the MCI driver. */
void MCI_ioctl (MCI_Handle handle, const MCI_Config *pConfig)
{
    if (handle == LPCLIB_INVALID_HANDLE) {
        return;
    }

    switch (pConfig->opcode) {
    case MCI_OPCODE_BUS_CONFIG:
        handle->maxClockHz = pConfig->bus.maxClockHz;
        handle->flags.allow4Bit = pConfig->bus.allow4Bit;
        break;

    case MCI_OPCODE_SET_CALLBACK:
        handle->callback = pConfig->callback;
        break;

    case MCI_OPCODE_CONNECT:
        if ((pConfig->connect.isInserted) && (handle->state == MCI_STATE_UNKNOWN)) {
            /* Card inserted! */
            MCI_setCardClock(handle, 400000ul);
            LPC_MCI->POWER =                /* Power UP: Power active, but clock still off */
                    (MCI_PWR_CTRL_UP << MCI_PWR_CTRL_Pos)
                |   (MCI_PWR_OPENDRAIN_ON << MCI_PWR_OPENDRAIN_Pos)
                |   (MCI_PWR_ROD_OFF << MCI_PWR_ROD_Pos);
            osDelay(5);                     /* Must be long enough to guarantee stable power */
            LPC_MCI->POWER =                /* Power ON: Power active, clock active */
                    (MCI_PWR_CTRL_ON << MCI_PWR_CTRL_Pos)
                |   (MCI_PWR_OPENDRAIN_ON << MCI_PWR_OPENDRAIN_Pos)
                |   (MCI_PWR_ROD_ON << MCI_PWR_ROD_Pos);
            osDelay(2);                     /* Must be >= 1 ms to guarantee card initialization */

            MCI_sendCommand(_MCI_makeCommandWord(
                                MCI_CMD0__GO_IDLE_STATE,
                                MCI_RESPONSE_NONE,
                                MCI_COMMAND_ENABLE_Msk),
                            0,
                            MCI_MASK0_CMDSENT_Msk);
        }

        if (!(pConfig->connect.isInserted)) {   //TODO this is just a quick hack...
            /* Card removed! */
            LPC_MCI->MASK0 = 0; //no more interrupts

