einergehtnochrein/fifi__fifisdr-firmware/pdl/drivers/lpc1700/src/lpc17xx_mci.c
            handle->state = MCI_STATE_UNKNOWN;

            if (handle->dma != LPCLIB_INVALID_HANDLE) {
                DMA_cancelJob(handle->dma);
                handle->dma = LPCLIB_INVALID_HANDLE;
            }

            MCI_setCardClock(handle, 400000ul);

            LPC_MCI->POWER =                /* Power OFF */
                    (MCI_PWR_CTRL_OFF << MCI_PWR_CTRL_Pos)
                |   (MCI_PWR_OPENDRAIN_ON << MCI_PWR_OPENDRAIN_Pos)
                |   (MCI_PWR_ROD_OFF << MCI_PWR_ROD_Pos);
            osDelay(1);                     /* Wait >= 1 ms to ensure power is really off */
        }
        break;

    case MCI_OPCODE_SELECT_CARD:
        if (handle->state == MCI_STATE_STANDBY) {
            handle->state = MCI_STATE_STANDBY_SENT_CMD7;

            _MCI_disableOpenDrain();
            MCI_setCardClock(handle, handle->maxClockHz);

            MCI_sendCommand(_MCI_makeCommandWord(
                                MCI_CMD7__SELECT_DESELECT_CARD,
                                MCI_RESPONSE_R1b,
                                MCI_COMMAND_ENABLE_Msk),
                            handle->rca,
                             MCI_MASK0_CMDCRCFAIL_Msk
                           | MCI_MASK0_CMDTIMEOUT_Msk
                           | MCI_MASK0_CMDRESPOND_Msk);
        }
        break;

    default:
        break;
    }
}


/** Callback for DMA events. */
static void MCI_dmaCallback (LPCLIB_Event event)
{
    const MCI_Handle handle = event.parameter;
    LPCLIB_Event mciEvent = {
        .id = LPCLIB_EVENTID_MCI,
        .parameter = 0, };

    if (handle != LPCLIB_INVALID_HANDLE) {
        if (handle->callback) {
            switch (event.opcode) {
            case DMA_EVENT_STOP:
                mciEvent.opcode = MCI_EVENT_READ_WRITE_COMPLETE;
                handle->callback(mciEvent);             /* Inform about end of job */
                break;
            }
        }
    }
}


#include <stdio.h>

/* Read sector(s) from card. */
LPCLIB_Result MCI_read (MCI_Handle handle,
                        void *pData,
                        int firstSector,
                        int numSectors,
                        DMA_ChannelHandle dma)
{
    LPCLIB_Result result = LPCLIB_BUSY;
    DMA_Job *pDmaJob = NULL;

//printf("R: S=%d, n=%d\r\n", firstSector, numSectors);

    if (handle == LPCLIB_INVALID_HANDLE) {
        return LPCLIB_ILLEGAL_PARAMETER;
    }

    if (numSectors == 0) {
        return LPCLIB_ILLEGAL_PARAMETER;
    }

    /* Card must be ready for a transfer */
    if (handle->state != MCI_STATE_TRANSFER) {
        return LPCLIB_NOT_PREPARED;
    }

    /* Get exclusive access */
    if (osMutexWait(handle->accessMutex, osWaitForever) == osOK) {
        /* Make sure to reset the sync flag */
        osSemaphoreWait(handle->syncSema, 0);

        handle->state = MCI_STATE_DATA;
        handle->pRx = pData;
        handle->result = LPCLIB_SUCCESS;

        /* Prepare DMA transfer if requested. */
        handle->dma = dma;
        if (handle->dma != LPCLIB_INVALID_HANDLE) {     /* DMA transfer */
            /* Ask DMA driver for memory */
            pDmaJob = DMA_allocPhaseMemory(handle->dma, 1);
            if (pDmaJob == NULL) {
                /* Fall back to interrupt mode */
                handle->dma = LPCLIB_INVALID_HANDLE;
            }
            else {
                handle->pDmaJob = pDmaJob;

                /* Prepare DMA job */
                pDmaJob->source = DMA_PERIPHERAL_SDCARD;
                pDmaJob->destination = DMA_PERIPHERAL_MEMORY;
                pDmaJob->flowControl = DMA_FLOW_PER2MEM_SRC;

                DMA_makePhase(
                    pDmaJob->firstPhase,
                    (uint32_t)&LPC_MCI->FIFO,
                    (uint32_t)pData,
                    handle,
                    DMA_makePhaseParameter(
                        0,                  /* Number of transfers determined by MCI block */
                        DMA_BURSTSIZE_8,    /* Source burst size */
                        DMA_BURSTSIZE_4,    /* Destination burst size */
                        DMA_WIDTH_32,       /* Source width */
                        DMA_WIDTH_32,       /* Destination width */
                        DISABLE,            /* Source increment */
                        ENABLE,             /* Destination increment */
                        DISABLE             /* No callback */
                        )
                    );

                pDmaJob->channel = handle->dma;
                pDmaJob->callback = MCI_dmaCallback;
                DMA_submitJob(dma, pDmaJob);
            }
        }

        /* Without DMA the clock frequency must be reduced drastically. */
        if (handle->dma == LPCLIB_INVALID_HANDLE) {
            MCI_setCardClock(handle, MCICLK_INTERRUPT_MODE);
        }

        /* Prepare for data phase. Different card commands apply depending on whether this is
         * a single or multiple sector read.
         */
        LPC_MCI->DATALENGTH = 512 * numSectors;
        LPC_MCI->DATATIMER = 0xFFFFFFFF;    //TODO
        LPC_MCI->DATACTRL =
                (MCI_DATACTRL_BLOCKSIZE_512 << MCI_DATACTRL_BLOCKSIZE_Pos)
              | ((handle->dma != LPCLIB_INVALID_HANDLE) ? MCI_DATACTRL_DMAENABLE_Msk : 0)
              | MCI_DATACTRL_DIRECTION_Msk
              | MCI_DATACTRL_ENABLE_Msk;
        LPC_MCI->ARGUMENT = (handle->flags.isHighCapacity) ? firstSector : 512 * firstSector;

        if (numSectors == 1) {
            LPC_MCI->MASK0 =
                    MCI_MASK0_DATACRCFAIL_Msk
                  | MCI_MASK0_DATATIMEOUT_Msk
                  | MCI_MASK0_DATABLOCKEND_Msk
                  | MCI_MASK0_CMDCRCFAIL_Msk
                  | MCI_MASK0_CMDTIMEOUT_Msk
                  /*| MCI_MASK0_CMDRESPOND_Msk */;
            LPC_MCI->COMMAND = _MCI_makeCommandWord(
                    MCI_CMD17__READ_SINGLE_BLOCK,
                    MCI_RESPONSE_R1,
                    MCI_COMMAND_ENABLE_Msk);
        }
        else {
            LPC_MCI->MASK0 =
                    MCI_MASK0_DATACRCFAIL_Msk
                  | MCI_MASK0_DATATIMEOUT_Msk
//                  | MCI_MASK0_DATABLOCKEND_Msk
                  | MCI_MASK0_DATAEND_Msk
                  | MCI_MASK0_CMDCRCFAIL_Msk
                  | MCI_MASK0_CMDTIMEOUT_Msk
                 /* | MCI_MASK0_CMDRESPOND_Msk*/;
            LPC_MCI->COMMAND = _MCI_makeCommandWord(
                    MCI_CMD18__READ_MULTIPLE_BLOCK,
                    MCI_RESPONSE_R1,
                    MCI_COMMAND_ENABLE_Msk);
        }

        /* Wait for the end of transaction. */
        if (osSemaphoreWait(handle->syncSema, 5000 /*TODO*/) > 0) {
            result = handle->result;
        }
        else {
            result = LPCLIB_ERROR;
        }

//printf(" -> %d\r\n", result);

        /* Return job/phase memory */
        if (handle->dma != LPCLIB_INVALID_HANDLE) {
            DMA_freePhaseMemory(handle->dma, pDmaJob);

            /* TODO
             * Kill this DMA job (if everything went fine, this is not necessary. But in case of an
             * error, the DMA job may not have run at all.
             */
            DMA_cancelJob(handle->dma);
        }

        osMutexRelease(handle->accessMutex);
    }

    return result;
}



/* Write sector(s) to card. */
LPCLIB_Result MCI_write (MCI_Handle handle,
                         const void *pData,
                         int firstSector,
                         int numSectors,
                         DMA_ChannelHandle dma)
{
    LPCLIB_Result result = LPCLIB_BUSY;
    DMA_Job *pDmaJob = NULL;

//printf("W: S=%d, n=%d\r\n", firstSector, numSectors);

    if (handle == LPCLIB_INVALID_HANDLE) {
        return LPCLIB_ILLEGAL_PARAMETER;
    }

    if (numSectors == 0) {
        return LPCLIB_ILLEGAL_PARAMETER;
    }

    /* Card must be ready for a transfer */
    if (handle->state != MCI_STATE_TRANSFER) {
        return LPCLIB_NOT_PREPARED;
    }

    /* Get exclusive access */
    if (osMutexWait(handle->accessMutex, osWaitForever) == osOK) {
        /* Make sure to reset the sync flag */
        osSemaphoreWait(handle->syncSema, 0);

        handle->state = MCI_STATE_RECEIVE;
        handle->pTx = pData;
        handle->result = LPCLIB_SUCCESS;

