einergehtnochrein/fifi__fifisdr-firmware/pdl/drivers/lpc1700/src/lpc17xx_mci.c
        /* Prepare DMA transfer if requested. */
        handle->dma = dma;
        if (handle->dma != LPCLIB_INVALID_HANDLE) {     /* DMA transfer */
            /* Ask DMA driver for memory */
            pDmaJob = DMA_allocPhaseMemory(handle->dma, 1);
            if (pDmaJob == NULL) {
                /* Fall back to interrupt mode */
                handle->dma = LPCLIB_INVALID_HANDLE;
            }
            else {
                handle->pDmaJob = pDmaJob;

                /* Prepare DMA job */
                pDmaJob->source = DMA_PERIPHERAL_MEMORY;
                pDmaJob->destination = DMA_PERIPHERAL_SDCARD;
                pDmaJob->flowControl = DMA_FLOW_MEM2PER_DEST;

                DMA_makePhase(
                    pDmaJob->firstPhase,
                    (uint32_t)pData,
                    (uint32_t)&LPC_MCI->FIFO,
                    handle,
                    DMA_makePhaseParameter(
                        numSectors / 128,   /* Number of words in whole transaction */
                        DMA_BURSTSIZE_4,    /* Source burst size */
                        DMA_BURSTSIZE_8,    /* Destination burst size */
                        DMA_WIDTH_32,       /* Source width */
                        DMA_WIDTH_32,       /* Destination width */
                        ENABLE,             /* Source increment */
                        DISABLE,            /* Destination increment */
                        DISABLE             /* No callback */
                        )
                    );

                pDmaJob->channel = handle->dma;
                pDmaJob->callback = MCI_dmaCallback;
                DMA_submitJob(dma, pDmaJob);
            }
        }

        /* Without DMA the clock frequency must be reduced drastically. */
        if (handle->dma == LPCLIB_INVALID_HANDLE) {
            MCI_setCardClock(handle, MCICLK_INTERRUPT_MODE);
        }

        /* Prepare for data phase. Different card commands apply depending on whether this is
         * a single or multiple sector read.
         */
        LPC_MCI->DATALENGTH = 512 * numSectors;
        LPC_MCI->DATATIMER = 0xFFFFFFFF;    //TODO
        LPC_MCI->DATACTRL =
                (MCI_DATACTRL_BLOCKSIZE_512 << MCI_DATACTRL_BLOCKSIZE_Pos)
              | ((handle->dma != LPCLIB_INVALID_HANDLE) ? MCI_DATACTRL_DMAENABLE_Msk : 0);
        LPC_MCI->ARGUMENT = (handle->flags.isHighCapacity) ? firstSector : 512 * firstSector;

        if (numSectors == 1) {
            LPC_MCI->MASK0 =
                    MCI_MASK0_DATACRCFAIL_Msk
                  | MCI_MASK0_DATATIMEOUT_Msk
                  | MCI_MASK0_DATABLOCKEND_Msk
                  | MCI_MASK0_CMDCRCFAIL_Msk
                  | MCI_MASK0_CMDTIMEOUT_Msk
                  | MCI_MASK0_CMDRESPOND_Msk;
            LPC_MCI->COMMAND = _MCI_makeCommandWord(
                    MCI_CMD24__WRITE_BLOCK,
                    MCI_RESPONSE_R1,
                    MCI_COMMAND_ENABLE_Msk);
        }
        else {
            LPC_MCI->MASK0 =
                    MCI_MASK0_DATACRCFAIL_Msk
                  | MCI_MASK0_DATATIMEOUT_Msk
//                  | MCI_MASK0_DATABLOCKEND_Msk
                  | MCI_MASK0_DATAEND_Msk
                  | MCI_MASK0_CMDCRCFAIL_Msk
                  | MCI_MASK0_CMDTIMEOUT_Msk
                  | MCI_MASK0_CMDRESPOND_Msk;
            LPC_MCI->COMMAND = _MCI_makeCommandWord(
                    MCI_CMD25__WRITE_MULTIPLE_BLOCK,
                    MCI_RESPONSE_R1,
                    MCI_COMMAND_ENABLE_Msk);
        }

        /* Wait for the end of transaction. */
        if (osSemaphoreWait(handle->syncSema, 5000 /*TODO*/) > 0) {
            result = handle->result;
        }
        else {
            result = LPCLIB_ERROR;
        }

        if (handle->dma != LPCLIB_INVALID_HANDLE) {
            /* Return job/phase memory */
            DMA_freePhaseMemory(handle->dma, pDmaJob);

            /* TODO
             * Kill this DMA job (if everything went fine, this is not necessary. But in case of an
             * error, the DMA job may not have run at all.
             */
            DMA_cancelJob(handle->dma);
        }

        osMutexRelease(handle->accessMutex);
    }

    return result;
}



/** Send event to a registered callback */
static void MCI_sendCallback (MCI_Handle handle, LPCLIB_Event *pEvent)
{
    if (handle->callback) {
        handle->callback(*pEvent);
    }
}



/** MCI block interrupt entry (interrupt number \ref MCI_IRQn).
 */
void MCI_IRQHandler (void)
{
    uint32_t status;
    uint32_t cardStatus;
    MCI_Handle handle = &mciContext;
    bool fail;
    bool busy;
    LPCLIB_Event event;


    status = LPC_MCI->STATUS;                           /* Active interrupt requests */
    LPC_MCI->CLEAR = status & MCI_CLEAR_Msk;            /* NOTE: This works because STATUS and CLEAR
                                                         *       registers have corresponding bits
                                                         *       at the same position!
                                                         */

    /* Prepare event in case we need it */
    event.id = LPCLIB_EVENTID_MCI;
    event.opcode = MCI_EVENT_CARD_INVALID;              /* Assume the worst... */

    switch (handle->state) {
    case MCI_STATE_UNKNOWN:                 /* No info about card state available */
        if (status & MCI_STATUS_CMDSENT_Msk) {          /* Has CMD0 been sent? */
            /* Check if card responds to CMD8 */
            handle->state = MCI_STATE_IDLE_SENT_CMD8;
            LPC_MCI->MASK0 = MCI_MASK0_CMDCRCFAIL_Msk
                           | MCI_MASK0_CMDTIMEOUT_Msk
                           | MCI_MASK0_CMDRESPOND_Msk;
            LPC_MCI->ARGUMENT = 0x000001AA;             /* Indicate 2.7...3.6V */
            LPC_MCI->COMMAND = _MCI_makeCommandWord(
                    MCI_CMD8__SEND_IF_COND,
                    MCI_RESPONSE_R7,
                    MCI_COMMAND_ENABLE_Msk);
            handle->flags.supportSDV2 = 0;
        }
        else {
            /* Send CMD0 to bring card into idle state */
            LPC_MCI->MASK0 = MCI_MASK0_CMDSENT_Msk;     /* Possible events */
            LPC_MCI->ARGUMENT = 0;
            LPC_MCI->COMMAND = MCI_CMD0__GO_IDLE_STATE | MCI_COMMAND_ENABLE_Msk;
        }
        break;

    case MCI_STATE_IDLE_SENT_CMD8:          /* Check reply to CMD8.
                                             * A correct response indicates V2 spec compatibility.
                                             * Non-V2 compatible cards do not respond.
                                             */
        /* A card is invalid if its response does not echo our pattern,
         * or if the response has a CRC failure.
         */
        fail =  ((status & MCI_STATUS_CMDRESPOND_Msk) && ((LPC_MCI->RESPONSE0 & 0xFF) != 0xAA))
             || (status & MCI_STATUS_CMDCRCFAIL_Msk);
        if (fail) {
            handle->state = MCI_STATE_INACTIVE;
            MCI_sendCallback(handle, &event);           /* Inform application */
        }
        else {
            handle->state = MCI_STATE_IDLE_SENT_ACMD41;

            if (status & MCI_STATUS_CMDRESPOND_Msk) {   /* Successful response? */
                handle->flags.supportSDV2 = 1;          /* V2 compatible */
            }

            /* Send APP_CMD (prepare ACMD41) */
            MCI_sendCommand(_MCI_makeCommandWord(
                                MCI_CMD55__APP_CMD,
                                MCI_RESPONSE_R1,
                                MCI_COMMAND_ENABLE_Msk),
                            0,
                             MCI_MASK0_CMDCRCFAIL_Msk
                           | MCI_MASK0_CMDTIMEOUT_Msk
                           | MCI_MASK0_CMDRESPOND_Msk);

