einergehtnochrein/fifi__fifisdr-firmware/pdl/drivers/lpc1700/src/lpc17xx_mci.c
            handle->numRetriesACMD41 = 0;
        }
        break;

    case MCI_STATE_IDLE_SENT_ACMD41:
        /* Was it CMD55 or a completed ACMD41? */
        if (LPC_MCI->RESPCMD == MCI_CMD55__APP_CMD) {
            /* Send the ACMD41 now */
            MCI_sendCommand(_MCI_makeCommandWord(
                                MCI_ACMD41__SD_SEND_OP_COND,
                                MCI_RESPONSE_R3,
                                MCI_COMMAND_ENABLE_Msk),
                            handle->flags.supportSDV2 ? 0x40FC0000 : 0x00FC0000,    /* 3.0...3.6 V */
                             MCI_MASK0_CMDCRCFAIL_Msk
                           | MCI_MASK0_CMDTIMEOUT_Msk
                           | MCI_MASK0_CMDRESPOND_Msk);
        }
        else {
            /* A timeout indicates that this is an MMC card. Continue with CMD1 */
            if (status & MCI_STATUS_CMDTIMEOUT_Msk) {
                /* This is not an SD Card */
                handle->flags.isSDCard = 0;
            }
            else {
                /* We come here if we have a response (CRC failure indicates success here!) */
                busy = (LPC_MCI->RESPONSE0 & (1u << 31)) == 0;
                if (!busy) {
                    /* This is an SD Card */
                    handle->flags.isSDCard = 1;

                    /* End of init phase. */
                    handle->ocr = LPC_MCI->RESPONSE0;
                    handle->flags.isHighCapacity = (handle->ocr & (1u << 30)) != 0;

                    /* READY state. Send CMD2 to ask for CID register */
                    MCI_sendCommand(_MCI_makeCommandWord(
                                        MCI_CMD2__ALL_SEND_CID,
                                        MCI_RESPONSE_R2,
                                        MCI_COMMAND_ENABLE_Msk),
                                    0,
                                     MCI_MASK0_CMDCRCFAIL_Msk
                                   | MCI_MASK0_CMDTIMEOUT_Msk
                                   | MCI_MASK0_CMDRESPOND_Msk);
                    handle->state = MCI_STATE_READY_SENT_CMD2;
                }
                else {
                    /* Repeat up to one second */
                    ++handle->numRetriesACMD41;
                    if (handle->numRetriesACMD41 >= 4000) {
                        handle->state = MCI_STATE_INACTIVE;
                        MCI_sendCallback(handle, &event);   /* Inform application */
                    }
                    else {
                        /* Try again */
                        MCI_sendCommand(_MCI_makeCommandWord(
                                            MCI_CMD55__APP_CMD,
                                            MCI_RESPONSE_R1,
                                            MCI_COMMAND_ENABLE_Msk),
                                        0,
                                         MCI_MASK0_CMDCRCFAIL_Msk
                                       | MCI_MASK0_CMDTIMEOUT_Msk
                                       | MCI_MASK0_CMDRESPOND_Msk);
                    }
                }
            }
        }
        break;

    case MCI_STATE_READY_SENT_CMD2:
        if (status & MCI_STATUS_CMDRESPOND_Msk) {       /* Successful response? */
            /* Store the CID register */
            handle->cid[0] = LPC_MCI->RESPONSE3;
            handle->cid[1] = LPC_MCI->RESPONSE2;
            handle->cid[2] = LPC_MCI->RESPONSE1;
            handle->cid[3] = LPC_MCI->RESPONSE0;

            /* IDENT state. Assign a card address (RCA) */
            MCI_sendCommand(_MCI_makeCommandWord(
                                MCI_CMD3__SEND_RELATIVE_ADDR,
                                MCI_RESPONSE_R6,
                                MCI_COMMAND_ENABLE_Msk),
                            0,
                             MCI_MASK0_CMDCRCFAIL_Msk
                           | MCI_MASK0_CMDTIMEOUT_Msk
                           | MCI_MASK0_CMDRESPOND_Msk);

            handle->state = MCI_STATE_IDENT_SENT_CMD3;
        }
        else {
            handle->state = MCI_STATE_INACTIVE;
            MCI_sendCallback(handle, &event);           /* Inform application */
        }
        break;

    case MCI_STATE_IDENT_SENT_CMD3:
        if (status & MCI_STATUS_CMDRESPOND_Msk) {       /* Successful response? */
            /* Extract RCA fromcard response */
            handle->rca = LPC_MCI->RESPONSE0 & 0xFFFF0000;

            /* Entering STANDBY state. Send CMD9 to ask for CSD register */
            MCI_sendCommand(_MCI_makeCommandWord(
                                MCI_CMD9__SEND_CSD,
                                MCI_RESPONSE_R2,
                                MCI_COMMAND_ENABLE_Msk),
                            handle->rca,
                            MCI_MASK0_CMDCRCFAIL_Msk
                          | MCI_MASK0_CMDTIMEOUT_Msk
                          | MCI_MASK0_CMDRESPOND_Msk);

            handle->state = MCI_STATE_STANDBY_SENT_CMD9;
        }
        else {
            handle->state = MCI_STATE_INACTIVE;
            MCI_sendCallback(handle, &event);           /* Inform application */
        }
        break;

    case MCI_STATE_STANDBY_SENT_CMD9:
        if (status & MCI_STATUS_CMDRESPOND_Msk) {       /* Successful response? */
            handle->state = MCI_STATE_STANDBY;

            /* Store the CSD register */
            handle->csd[0] = LPC_MCI->RESPONSE3;
            handle->csd[1] = LPC_MCI->RESPONSE2;
            handle->csd[2] = LPC_MCI->RESPONSE1;
            handle->csd[3] = LPC_MCI->RESPONSE0;

            /* Extract card capacity */
            handle->capacity = _MCI_getCardCapacity(handle);

            event.opcode = MCI_EVENT_CARD_STANDBY;
            event.parameter = (void *)handle->capacity;
            MCI_sendCallback(handle, &event);           /* Inform application */
        }
        else {
            handle->state = MCI_STATE_INACTIVE;
            MCI_sendCallback(handle, &event);           /* Inform application */
        }
        break;

    case MCI_STATE_STANDBY_SENT_CMD7:
        if (status & MCI_STATUS_CMDRESPOND_Msk) {       /* Successful response? */
            handle->state = MCI_STATE_TRANSFER_SENT_ACMD6;

            /* Send APP_CMD (prepare ACMD6) */
            MCI_sendCommand(_MCI_makeCommandWord(
                                MCI_CMD55__APP_CMD,
                                MCI_RESPONSE_R1,
                                MCI_COMMAND_ENABLE_Msk),
                            handle->rca,
                             MCI_MASK0_CMDCRCFAIL_Msk
                           | MCI_MASK0_CMDTIMEOUT_Msk
                           | MCI_MASK0_CMDRESPOND_Msk);
        }
        else {
            handle->state = MCI_STATE_INACTIVE;
            MCI_sendCommand(_MCI_makeCommandWord(
                                MCI_CMD0__GO_IDLE_STATE,
                                MCI_RESPONSE_NONE,
                                MCI_COMMAND_ENABLE_Msk),
                            0,
                            MCI_MASK0_CMDSENT_Msk);
            MCI_sendCallback(handle, &event);           /* Inform application */
        }
        break;

    case MCI_STATE_TRANSFER_SENT_ACMD6:
        if (status & MCI_STATUS_CMDRESPOND_Msk) {       /* Successful response? */
            /* Was it CMD55 or a completed ACMD6? */
            if (LPC_MCI->RESPCMD == MCI_CMD55__APP_CMD) {
                /* Send ACMD6 */
                MCI_sendCommand(_MCI_makeCommandWord(
                                    MCI_ACMD6__SET_BUS_WIDTH,
                                    MCI_RESPONSE_R1,
                                    MCI_COMMAND_ENABLE_Msk),
                                handle->flags.allow4Bit ? 2 : 0,
                                MCI_MASK0_CMDCRCFAIL_Msk
                            | MCI_MASK0_CMDTIMEOUT_Msk
                            | MCI_MASK0_CMDRESPOND_Msk);
            }
            else {
                /* Set MCI block data bus width */
                LPCLIB_BITBAND(&LPC_MCI->CLOCK, MCI_CLOCK_WIDEBUS_Pos) =
                        handle->flags.allow4Bit ? 1 : 0;

                handle->state = MCI_STATE_TRANSFER;

