einergehtnochrein/fifi__fifisdr-firmware/pdl/drivers/lpc1700/src/lpc17xx_mci.c
                event.opcode = MCI_EVENT_CARD_SELECTED;
                event.parameter = (void *)handle->capacity;
                MCI_sendCallback(handle, &event);           /* Inform application */
            }
        }
        else {
            handle->state = MCI_STATE_INACTIVE;
            MCI_sendCommand(_MCI_makeCommandWord(
                                MCI_CMD0__GO_IDLE_STATE,
                                MCI_RESPONSE_NONE,
                                MCI_COMMAND_ENABLE_Msk),
                            0,
                            MCI_MASK0_CMDSENT_Msk);
            MCI_sendCallback(handle, &event);           /* Inform application */
        }
        break;

    case MCI_STATE_DATA:
        /* Any failure (CRC fail, timeout)? */
        if (status & (
                MCI_STATUS_CMDCRCFAIL_Msk
              | MCI_STATUS_CMDTIMEOUT_Msk
              | MCI_STATUS_DATACRCFAIL_Msk
              | MCI_STATUS_DATATIMEOUT_Msk)) {
            handle->result = LPCLIB_CRC_FAILURE;

            event.opcode = MCI_EVENT_READ_WRITE_COMPLETE;
            osSemaphoreRelease(handle->syncSema);
        }

        /* Successful end of transfer? */
        else if (status & MCI_STATUS_DATAEND_Msk) {
            if (LPC_MCI->RESPCMD == MCI_CMD18__READ_MULTIPLE_BLOCK) {
                /* Send CMD12 (Stop) */
                MCI_sendCommand(_MCI_makeCommandWord(
                                    MCI_CMD12__STOP_TRANSMISSION,
                                    MCI_RESPONSE_R1b,
                                    MCI_COMMAND_ENABLE_Msk),
                                0,
                                MCI_MASK0_CMDCRCFAIL_Msk
                              | MCI_MASK0_CMDTIMEOUT_Msk
                              | MCI_MASK0_CMDRESPOND_Msk);

                handle->state = MCI_STATE_DATA_SENT_CMD12;
            }
            else {
                handle->state = MCI_STATE_TRANSFER;

                /* Single block transfer is now over */
                event.opcode = MCI_EVENT_READ_WRITE_COMPLETE;
                osSemaphoreRelease(handle->syncSema);
            }
        }

        else if (status & MCI_STATUS_CMDRESPOND_Msk) {
        }

        else {
            handle->state = MCI_STATE_TRANSFER;
        }
        break;

    case MCI_STATE_DATA_SENT_CMD12:
        handle->state = MCI_STATE_TRANSFER;

        if (status & MCI_STATUS_CMDRESPOND_Msk) {
            event.opcode = MCI_EVENT_READ_WRITE_COMPLETE;
            osSemaphoreRelease(handle->syncSema);
        }
        else {
            handle->result = LPCLIB_CRC_FAILURE;

            event.opcode = MCI_EVENT_READ_WRITE_COMPLETE;
            osSemaphoreRelease(handle->syncSema);
        }
        break;

    case MCI_STATE_RECEIVE:
        /* Any failure (CRC fail, timeout)? */
        if (status & (
            MCI_STATUS_CMDCRCFAIL_Msk
              | MCI_STATUS_CMDTIMEOUT_Msk
              | MCI_STATUS_DATACRCFAIL_Msk
              | MCI_STATUS_DATATIMEOUT_Msk)) {
            handle->result = LPCLIB_CRC_FAILURE;
            handle->state = MCI_STATE_TRANSFER;

            event.opcode = MCI_EVENT_READ_WRITE_COMPLETE;
            osSemaphoreRelease(handle->syncSema);
        }

        /* Successful end of transfer? */
        else if (status & MCI_STATUS_DATAEND_Msk) {
            if (LPC_MCI->RESPCMD == MCI_CMD25__WRITE_MULTIPLE_BLOCK) {
                handle->state = MCI_STATE_RECEIVE_SENT_CMD12;

                /* Send CMD12 (Stop) */
                MCI_sendCommand(_MCI_makeCommandWord(
                                    MCI_CMD12__STOP_TRANSMISSION,
                                    MCI_RESPONSE_R1b,
                                    MCI_COMMAND_ENABLE_Msk),
                                0,
                                MCI_MASK0_CMDCRCFAIL_Msk
                            | MCI_MASK0_CMDTIMEOUT_Msk
                            | MCI_MASK0_CMDRESPOND_Msk);
            }
            else {
                handle->state = MCI_STATE_PROGRAM;

                /* Send CMD13 (Read status register) */
                MCI_sendCommand(_MCI_makeCommandWord(
                                    MCI_CMD13__SEND_STATUS,
                                    MCI_RESPONSE_R1,
                                    MCI_COMMAND_ENABLE_Msk),
                                handle->rca,
                                MCI_MASK0_CMDCRCFAIL_Msk
                              | MCI_MASK0_CMDTIMEOUT_Msk
                              | MCI_MASK0_CMDRESPOND_Msk);
            }
        }

        else if (status & MCI_STATUS_CMDRESPOND_Msk) {
            /* Enable Data Path State Machine */
            LPCLIB_BITBAND(&LPC_MCI->DATACTRL, MCI_DATACTRL_ENABLE_Pos) = 1;
        }

        else {
            handle->state = MCI_STATE_TRANSFER;
        }
        break;

    case MCI_STATE_RECEIVE_SENT_CMD12:
        if (status & MCI_STATUS_CMDRESPOND_Msk) {
            handle->state = MCI_STATE_PROGRAM;

            /* Send CMD13 (Read status register) */
            MCI_sendCommand(_MCI_makeCommandWord(
                                MCI_CMD13__SEND_STATUS,
                                MCI_RESPONSE_R1,
                                MCI_COMMAND_ENABLE_Msk),
                            handle->rca,
                            MCI_MASK0_CMDCRCFAIL_Msk
                          | MCI_MASK0_CMDTIMEOUT_Msk
                          | MCI_MASK0_CMDRESPOND_Msk);
        }
        else {
            handle->state = MCI_STATE_TRANSFER;
            handle->result = LPCLIB_CRC_FAILURE;

            event.opcode = MCI_EVENT_READ_WRITE_COMPLETE;
            osSemaphoreRelease(handle->syncSema);
        }
        break;

    case MCI_STATE_PROGRAM:
        if (status & MCI_STATUS_CMDRESPOND_Msk) {
            /* Has the card reached TRANSFER state? */
            cardStatus = LPC_MCI->RESPONSE0;
            if (((cardStatus & MCI_CARDSTATUS_CURRENT_STATE_Msk) >> MCI_CARDSTATUS_CURRENT_STATE_Pos) == 4) {
                handle->state = MCI_STATE_TRANSFER;

                event.opcode = MCI_EVENT_READ_WRITE_COMPLETE;
                osSemaphoreRelease(handle->syncSema);
            }
            else {
                /* Try again TODO loop limit */

                /* Send CMD13 (Read status register) */
                MCI_sendCommand(_MCI_makeCommandWord(
                                    MCI_CMD13__SEND_STATUS,
                                    MCI_RESPONSE_R1,
                                    MCI_COMMAND_ENABLE_Msk),
                                handle->rca,
                                MCI_MASK0_CMDCRCFAIL_Msk
                              | MCI_MASK0_CMDTIMEOUT_Msk
                              | MCI_MASK0_CMDRESPOND_Msk);
            }
        }
        else {
            handle->state = MCI_STATE_INACTIVE;
            MCI_sendCommand(_MCI_makeCommandWord(
                                MCI_CMD0__GO_IDLE_STATE,
                                MCI_RESPONSE_NONE,
                                MCI_COMMAND_ENABLE_Msk),
                            0,
                            MCI_MASK0_CMDSENT_Msk);
            MCI_sendCallback(handle, &event);           /* Inform application */
        }
        break;

    default:
        break;
    }
}


/** @} */

/** @} addtogroup MCI */

#endif  /* #ifdef LPCLIB_MCI */

